<img src="../Img/Python_SQL_PI.png" style="width:100%">


<p style="font-size:160%;text-align:center">Семинар 6.1. Соединение таблиц с помощью оператора LEFT OUTER JOIN</p> 

<a id = Home></a>

**21 апреля 2022 года, чт**<br>
5-я пара, 15:40 - 17:10<br>
В4/3411(кк) (4-й Вешняковский проезд, 4)<br>
ПИ20-1, ПИ20-2, ПИ20-3, ПИ20-4, ПИ20-5, ПИ20-6 (2 подгруппа)<br>


**25 апреля 2022 года, пн**<br>
2-я пара, 10:10 - 11:40<br>
Щ38/509(кк) (ул. Щербаковская, 38)<br>
ПИ20-1, ПИ20-2, ПИ20-3, ПИ20-4, ПИ20-5, ПИ20-6 (4 подгруппа)<br>

3-я пара, 11:50 - 13:20<br>
Щ38/509(кк) (ул. Щербаковская, 38)<br>
Поток:ПИ20-1, ПИ20-2, ПИ20-3, ПИ20-4, ПИ20-5, ПИ20-6 (3 подгруппа)


**28 апреля 2022 года, чт**<br>
6-я пара, 17:20 - 18:50<br>
В4/3411(кк) (4-й Вешняковский проезд, 4)<br>
ПИ20-1, ПИ20-2, ПИ20-3, ПИ20-4, ПИ20-5, ПИ20-6 (1 подгруппа)<br>


```
STUDENT
STUDENT_ID — числовой код, идентифицирующий студента (идентификатор студента),
SURNAME — фамилия студента,
NAME — имя студента,
STIPEND — стипендия, которую получает студент,
KURS — курс, на котором учится студент,
CITY — город, в котором живет студент,
BIRTHDAY — дата рождения студента,
UNIV_ID — идентификатор университета, в котором учится студент.


LECTURER
LECTURER_ID — идентификатор преподавателя,
SURNAME — фамилия преподавателя,
NAME — имя преподавателя,
CITY — город, в котором живет преподаватель,
UNIV_ID — идентификатор университета, в котором работает преподаватель


SUBJECT
SUBJ_ID — идентификатор предмета обучения,
SUBJ_NAME — наименование предмета обучения,
HOUR — количество часов, отводимых на изучение предмета,
SEMESTER — семестр, в котором изучается данный предмет.


UNIVERSITY
UNIV_ID — идентификатор университета,
UNIV_NAME — название университета,
RATING — рейтинг университета,
CITY — город, в котором расположен университет.


EXAM_MARKS
EXAM_ID — идентификатор экзамена,
STUDENT_ID — идентификатор студента,
SUBJ_ID — идентификатор предмета обучения,
MARK — экзаменационная оценка,
EXAM_DATE — дата экзамена.


SUBJ_LECT
LECTURER_ID — идентификатор преподавателя,
SUBJ_ID — идентификатор предмета обучения.
```

<img src="../Img/Students_Schema.png" style="width:60%">

In [2]:
#! pip install sqlalchemy

In [1]:
import pandas as pd
from sqlalchemy import MetaData, Table, create_engine, select, and_, or_, not_, text
from sqlalchemy.sql import func, distinct, exists

In [2]:
engine = create_engine('sqlite:///../Data/Students.db')
metadata_obj = MetaData() # Объект-контейнер, содержит информацию о схеме данных
metadata_obj.reflect(bind=engine) # Отображение БД

Создание объектов таблиц

In [3]:
exam_marks=Table("exam_marks", metadata_obj, autoload=True, autoload_with="engine")
lecturer=Table("lecturer", metadata_obj, autoload=True, autoload_with="engine")
student=Table("student", metadata_obj, autoload=True, autoload_with="engine")
subj_lect=Table("subj_lect", metadata_obj, autoload=True, autoload_with="engine")
subject=Table("subject", metadata_obj, autoload=True, autoload_with="engine")
university=Table("university", metadata_obj, autolad=True, autolad_with="engine")

In [4]:
conn=engine.connect() # Соединение

<img src=../Img/pencil.png style="width:190px;height:190px">
<p style="background-color:powderblue; font-size:125%; color: rebeccapurple;">Выполните задания</p>
<p>Выполните задания с помощью соедиинения таблиц в Jupyter Notebook </p>

1. Напишите запрос, который выполняет вывод фамилий студентов, сдававших экзамены, вместе с идентификаторами каждого сданного ими предмета обучения.

2. Напишите запрос, который выполняет выборку фамилий всех студентов, с указанием для студентов, сдававших экзамены, идентификаторов сданных ими предметов обучения.

3. Напишите запрос, который выполняет вывод фамилий студентов, сдававших экзамены, вместе с наименованиями каждого сданного ими предмета обучения.

4. Напишите запрос на выдачу списка всех студентов. Для студентов, сдававших экзамены, укажите названия соответствующих предметов обучения.

5. Напишите запрос на выдачу названий всех предметов, по которым студенты получили только хорошие (4 и 5) оценки. В выходных данных должны быть приведены фамилии студентов, названия предметов и оценка.

6. Напишите запрос, который выполняет вывод списка университетов с рейтингом, превышающим 300, вместе со значением максимального размера стипендии, получаемой студентами в этих университетах.

7. Напишите запрос на выдачу списка студентов (в алфавитном порядке фамилий) вместе со значением рейтинга университета, где каждый из них учится, включив в список и тех студентов, место учебы которых в базе данных не указано.

8. Напишите запрос для получения списка всех студентов вместе с названиями университетов, в которых они учатся. Отдельным запросом получите записи, расширяющие данный список по сравнению с тем, который был бы получен внутренним соединением.

9. Напишите запрос для получения списка всех университетов вместе с фамилиями студентов, в них обучающихся. Отдельным запросом получите записи, расширяющие данный список по сравнению с тем, который был бы получен внутренним соединением.

10. Напишите запрос для получения списка всех университетов вместе с фамилиями преподавателей, в них работающих. Отдельным запросом получите записи, расширяющие данный список по сравнению с тем, который был бы получен внутренним соединением.

11. Напишите запрос для получения списка всех преподавателей вместе с университетами, в которых они работают. Есть ли отличие списка от того, который был бы получен внутренним соединением? Подтвердите отдельным запросом ваш вывод.

12. Напишите запрос для получения списка всех студентов и оценок, полученных ими на экзаменах. Отдельным запросом получите записи, расширяющие данный список по сравнению с тем, который был бы получен внутренним соединением.

13. Напишите запрос для получения списка всех экзаменационных оценок вместе с фамилиями получивших их студентов. Есть ли отличие списка от того, который был бы получен внутренним соединением? Подтвердите отдельным запросом ваш вывод.

14. Напишите запрос для получения полного списка предметов с соответствующими экзаменационными оценками. Есть ли отличие списка от того, который был бы получен внутренним соединением? Подтвердите отдельным запросом ваш вывод.

15. Напишите запрос для получения полного списка оценок вместе с названиями предметов, по которым они получены. Есть ли отличие списка от того, который был бы получен внутренним соединением? Подтвердите отдельным запросом ваш вывод.

# Решение

In [12]:
# Ваш код здесь.

# 1. Напишите запрос, который выполняет вывод фамилий студентов, сдававших экзамены, вместе с идентификаторами каждого сданного ими предмета обучения.


s = select(student.c.surname, exam_marks.c.subj_id).join(exam_marks, student.c.student_id == exam_marks.c.student_id).where(exam_marks.c.mark > 2)

print(s)
pd.read_sql(s, conn)

SELECT student.surname, exam_marks.subj_id
FROM student JOIN exam_marks ON student.student_id = exam_marks.student_id
WHERE exam_marks.mark > :mark_1

       surname  subj_id
0     Казакова       73
1          Жук       73
2      Кондрат       10
3      Лазарев       56
4      Блохина       22
5      Жданова       56
6     Семенова       94
7   Мельникова       10
8     Борисова       94
9     Васильев       73
10     Петрова       43
11     Антонов       10
12     Костина       22
13    Васильев       13
14    Кузнецов       12
15      Лапина       56
16       Котов       10
17     Сидоров       22
18      Белкин       10
19       Лукин       11
20         Пак       11
21         Пак       94
22         Пак       73
23  Мельникова       14
24  Мельникова       56
25     Зайцева       10

In [20]:
# 2. Напишите запрос, который выполняет выборку фамилий всех студентов, с указанием для студентов, сдававших экзамены, идентификаторов сданных ими предметов обучения.

s = select(student.c.surname, exam_marks.c.subj_id).join(exam_marks, isouter=True)

print(s)
pd.read_sql(s, conn)

SELECT student.surname, exam_marks.subj_id
FROM student LEFT OUTER JOIN exam_marks ON student.student_id = exam_marks.student_id

     surname  subj_id
0     Иванов     43.0
1     Петров      NaN
2    Сидоров     22.0
3   Кузнецов     12.0
4    Зайцева     10.0
..       ...      ...
95   Киселев      NaN
96  Миронова      NaN
97    Павлов      NaN
98    Петров      NaN
99     Лукин     11.0

[100 rows x 2 columns]

In [23]:
# 3. Напишите запрос, который выполняет вывод фамилий студентов, сдававших экзамены, вместе с наименованиями каждого сданного ими предмета обучения.

s = select(student.c.surname, subject.c.subj_name).join(exam_marks, exam_marks.c.student_id == student.c.student_id).join(subject, subject.c.subj_id == exam_marks.c.subj_id).where(exam_marks.c.mark > 2).order_by(student.c.surname)

print(s)
pd.read_sql(s, conn)

SELECT student.surname, subject.subj_name
FROM student JOIN exam_marks ON exam_marks.student_id = student.student_id JOIN subject ON subject.subj_id = exam_marks.subj_id
WHERE exam_marks.mark > :mark_1 ORDER BY student.surname

       surname                                 subj_name
0      Антонов                               Информатика
1       Белкин                               Информатика
2      Блохина                                    Физика
3     Борисова                           Английский язык
4     Васильев                               Физкультура
5     Васильев                                       ОБЖ
6      Жданова                                   История
7          Жук                               Физкультура
8      Зайцева                               Информатика
9     Казакова                               Физкультура
10     Кондрат                               Информатика
11     Костина                                    Физика
12       Котов                               Информатика
13    Кузнецов                             Анализ данных
14     Лазарев                                   История
15      Лапина                                   История
16       Лукин   Программирование на языках Python и SQL
17  Мельникова                               Информатика
18  Мельникова  Обработка данных и моделирование в Excel
19  Мельникова                                   История
20         Пак   Программирование на языках Python и SQL
21         Пак                           Английский язык
22         Пак                               Физкультура
23     Петрова                                Математика
24    Семенова                           Английский язык
25     Сидоров                                    Физика

In [32]:
# 4. Напишите запрос на выдачу списка всех студентов. Для студентов, сдававших экзамены, укажите названия соответствующих предметов обучения.

s = select(student.c.surname, subject.c.subj_name).outerjoin(exam_marks, exam_marks.c.student_id == student.c.student_id).outerjoin(subject).order_by(student.c.surname)

print(s)
pd.read_sql(s, conn)

SELECT student.surname, subject.subj_name
FROM student LEFT OUTER JOIN exam_marks ON exam_marks.student_id = student.student_id LEFT OUTER JOIN subject ON subject.subj_id = exam_marks.subj_id ORDER BY student.surname

       surname      subj_name
0     Агафонов           None
1      Аксенов           None
2      Антонов    Информатика
3      Архипов           None
4   Афанасьева  Анализ данных
..         ...            ...
95     Федоров  Анализ данных
96     Фролова           None
97      Ширяев           None
98      Шубина           None
99        Юдин           None

[100 rows x 2 columns]

In [36]:
# 5. Напишите запрос на выдачу названий всех предметов, по которым студенты получили только хорошие (4 и 5) оценки. В выходных данных должны быть приведены фамилии студентов, названия предметов и оценка.

s = select(student.c.surname, subject.c.subj_name, exam_marks.c.mark).join(exam_marks, exam_marks.c.student_id == student.c.student_id).join(subject).where(exam_marks.c.mark >= 4)

print(s)
pd.read_sql(s, conn)

SELECT student.surname, subject.subj_name, exam_marks.mark
FROM student JOIN exam_marks ON exam_marks.student_id = student.student_id JOIN subject ON subject.subj_id = exam_marks.subj_id
WHERE exam_marks.mark >= :mark_1

       surname                                 subj_name  mark
0     Казакова                               Физкультура     4
1          Жук                               Физкультура     4
2      Лазарев                                   История     4
3      Блохина                                    Физика     5
4      Жданова                                   История     5
5     Семенова                           Английский язык     4
6   Мельникова                               Информатика     5
7     Борисова                           Английский язык     5
8      Костина                                    Физика     4
9     Васильев                                       ОБЖ     5
10    Кузнецов                             Анализ данных     5
11      Лапина                                   История     5
12       Котов                               Информатика     4
13     Сидоров                                    Физика     4
14      Белкин                               Информатика     5
15       Лукин   Программирование на языках Python и SQL     4
16         Пак   Программирование на языках Python и SQL     5
17         Пак                           Английский язык     4
18  Мельникова  Обработка данных и моделирование в Excel     4
19     Зайцева                               Информатика     5

In [43]:
# 6. Напишите запрос, который выполняет вывод списка университетов с рейтингом, превышающим 300, вместе со значением максимального размера стипендии, получаемой студентами в этих университетах.

s = select(university, func.max(student.c.stipend)).join(student, university.c.univ_id == student.c.univ_id).where(university.c.rating > 300).group_by(university.c.univ_id)

print(s)
pd.read_sql(s, conn)

SELECT university.univ_id, university.univ_name, university.rating, university.city, max(student.stipend) AS max_1
FROM university JOIN student ON university.univ_id = student.univ_id
WHERE university.rating > :rating_1 GROUP BY university.univ_id

   univ_id         univ_name  rating             city  max_1
0       11               НГУ     345      Новосибирск    250
1       14               БГУ     326         Белгород    250
2       15               ТГУ     368            Томск    250
3       18              ВГМА     327          Воронеж    200
4       22               МГУ     606           Москва    250
5       32               РГУ     416           Ростов    250
6       44              ФинУ     330           Москва    250
7       45  МГТУ им. Баумана     372           Москва    200
8       46   ФГБОУ "Политех"     304  Санкт-Петербург    200

In [49]:
# 7. Напишите запрос на выдачу списка студентов (в алфавитном порядке фамилий) вместе со значением рейтинга университета, где каждый из них учится, включив в список и тех студентов, место учебы которых в базе данных не указано.

s = select(student.c.surname, university.c.rating, university.c.univ_id).outerjoin(university).order_by(student.c.surname)

print(s)
pd.read_sql(s, conn)

SELECT student.surname, university.rating, university.univ_id
FROM student LEFT OUTER JOIN university ON university.univ_id = student.univ_id ORDER BY student.surname

       surname  rating  univ_id
0     Агафонов   296.0       10
1      Аксенов   296.0       10
2      Антонов   606.0       22
3      Архипов   606.0       22
4   Афанасьева   416.0       32
..         ...     ...      ...
85     Федоров   296.0       10
86     Фролова   330.0       44
87      Ширяев   304.0       46
88      Шубина   372.0       45
89        Юдин   327.0       18

[90 rows x 3 columns]

In [53]:
# 8. Напишите запрос для получения списка всех студентов вместе с названиями университетов, в которых они учатся. Отдельным запросом получите записи, расширяющие данный список по сравнению с тем, который был бы получен внутренним соединением.

s = select(student.c.surname, student.c.name, university.c.univ_name).join(university, university.c.univ_id == student.c.univ_id)

s_1 = select(student.c.surname, student.c.name, university.c.univ_name).outerjoin(university, university.c.univ_id == student.c.univ_id)


print(s_1)
#pd.read_sql(s, conn)
pd.read_sql(s_1, conn)

SELECT student.surname, student.name, university.univ_name
FROM student LEFT OUTER JOIN university ON university.univ_id = student.univ_id

     surname      name         univ_name
0     Иванов      Иван               ВГУ
1     Петров      Петр               ВГУ
2    Сидоров     Вадим               МГУ
3   Кузнецов     Борис               ВГУ
4    Зайцева     Ольга               ВГУ
..       ...       ...               ...
85   Киселев  Владимир              ФинУ
86  Миронова     Федор  МГТУ им. Баумана
87    Павлов    Андрей               ВГУ
88    Петров     Антон               МГУ
89     Лукин     Артем               ВГУ

[90 rows x 3 columns]

In [67]:
# 9. Напишите запрос для получения списка всех университетов вместе с фамилиями студентов, в них обучающихся. Отдельным запросом получите записи, расширяющие данный список по сравнению с тем, который был бы получен внутренним соединением.

s = select(student.c.surname, student.c.name, university.c.univ_name).join(student, isouter=True).order_by(university.c.univ_name)

print(s)

pd.read_sql(s, conn)

SELECT student.surname, student.name, university.univ_name
FROM university LEFT OUTER JOIN student ON university.univ_id = student.univ_id ORDER BY university.univ_name

       surname        name univ_name
0   Владимиров    Анатолий       БГУ
1     Вячеслав     Пахомов       БГУ
2      Комаров        Ипат       БГУ
3   Кондратьев     Николай       БГУ
4      Костина        Кира       БГУ
..         ...         ...       ...
86     Морозов      Кирилл      ФинУ
87    Одинцова       Лидия      ФинУ
88      Петров       Вадим      ФинУ
89   Пономарев  Варфоромей      ФинУ
90     Фролова    Василиса      ФинУ

[91 rows x 3 columns]

In [57]:
# 10. Напишите запрос для получения списка всех университетов вместе с фамилиями преподавателей, в них работающих. Отдельным запросом получите записи, расширяющие данный список по сравнению с тем, который был бы получен внутренним соединением.

s = select(university.c.univ_name, lecturer.c.surname).join(lecturer, lecturer.c.univ_id == university.c.univ_id).order_by(lecturer.c.surname)

print(s)
pd.read_sql(s, conn)

SELECT university.univ_name, lecturer.surname
FROM university JOIN lecturer ON lecturer.univ_id = university.univ_id ORDER BY lecturer.surname

           univ_name     surname
0                ВГУ    Алексеев
1               ВГМА   Артемьева
2                РГУ     Беляков
3                ТГУ    Беспалов
4               ВГМА   Богданова
5               УЛГУ     Брагина
6   МГТУ им. Баумана      Волков
7               УЛГУ   Дмитриева
8                РГУ    Дорофеев
9               УЛГУ     Елисеев
10               ВГУ     Зайцева
11   ФГБОУ "Политех"       Зимин
12               ВГУ      Зыкова
13               ВГУ  Колесников
14              ВГМА     Крюкова
15               КФУ  Кудрявцева
16               КФУ    Куликова
17               МГУ     Лагутин
18               ВГУ   Максимова
19               НГУ   Мамонтова
20               ВГУ    Николаев
21               ВГУ     Никонов
22              ВГМА     Сафонов
23   ФГБОУ "Политех"    Сафонова
24              ВГМА   Ситникова
25               ВГУ     Сорокин
26   ФГБОУ "Политех"    Стрелков
27               МГУ     Струков
28               ТГУ     Тихонов

In [ ]:
# 11. Напишите запрос для получения списка всех преподавателей вместе с университетами, в которых они работают. Есть ли отличие списка от того, который был бы получен внутренним соединением? Подтвердите отдельным запросом ваш вывод.

#s = select()

In [59]:
# 12. Напишите запрос для получения списка всех студентов и оценок, полученных ими на экзаменах. Отдельным запросом получите записи, расширяющие данный список по сравнению с тем, который был бы получен внутренним соединением.

s = select(student.c.surname, student.c.name, exam_marks.c.mark).join(exam_marks, exam_marks.c.student_id == student.c.student_id).order_by(student.c.surname)

print(s)
pd.read_sql(s, conn)

SELECT student.surname, student.name, exam_marks.mark
FROM student JOIN exam_marks ON exam_marks.student_id = student.student_id ORDER BY student.surname

       surname        name  mark
0      Антонов    Анатолий   3.0
1   Афанасьева    Анжелика   1.0
2       Белкин       Вадим   5.0
3       Белкин       Вадим   NaN
4      Блохина      Ираида   5.0
5     Борисова      Марина   5.0
6     Васильев      Матвей   3.0
7     Васильев      Матвей   5.0
8      Веселов       Тимур   2.0
9    Вишнякова      Анжела   1.0
10    Вячеслав     Пахомов   2.0
11     Жданова       Ирина   5.0
12         Жук      Оксана   4.0
13       Жуков        Пров   1.0
14     Зайцева       Ольга   2.0
15     Зайцева       Ольга   5.0
16      Иванов        Иван   1.0
17    Казакова       Мария   4.0
18    Казакова       Мария   1.0
19  Калашников     Евгений   2.0
20  Калашников     Евгений   2.0
21     Кондрат     Синицин   3.0
22     Костина        Кира   4.0
23       Котов       Павел   4.0
24    Кузнецов       Борис   5.0
25     Лазарев  Константин   4.0
26      Лапина    Элеонора   5.0
27       Лукин       Артем   4.0
28  Мельникова       Дарья   2.0
29  Мельникова       Дарья   2.0
30  Мельникова    Светлана   5.0
31  Мельникова    Светлана   4.0
32  Мельникова    Светлана   3.0
33      Мишина    Светлана   1.0
34    Одинцова       Лидия   1.0
35   Ордуханян     Рафаэль   2.0
36         Пак       Ирина   5.0
37         Пак       Ирина   4.0
38         Пак       Ирина   3.0
39     Петрова   Екатерина   3.0
40    Семенова    Вероника   4.0
41    Сергеева       Фёкла   1.0
42     Сидоров       Вадим   4.0
43    Сорокина       Ирина   1.0
44     Суханов  Константин   1.0
45    Трофимов   Владислав   2.0
46     Федоров   Гостомысл   1.0

In [60]:
# 13. Напишите запрос для получения списка всех экзаменационных оценок вместе с фамилиями получивших их студентов. Есть ли отличие списка от того, который был бы получен внутренним соединением? Подтвердите отдельным запросом ваш вывод.

s = select(exam_marks.c.mark, student.c.surname).join(student, exam_marks.c.student_id == student.c.student_id).order_by(student.c.surname)

print(s)
pd.read_sql(s, conn)

SELECT exam_marks.mark, student.surname
FROM exam_marks JOIN student ON exam_marks.student_id = student.student_id ORDER BY student.surname

    mark     surname
0    3.0     Антонов
1    1.0  Афанасьева
2    5.0      Белкин
3    NaN      Белкин
4    5.0     Блохина
5    5.0    Борисова
6    3.0    Васильев
7    5.0    Васильев
8    2.0     Веселов
9    1.0   Вишнякова
10   2.0    Вячеслав
11   5.0     Жданова
12   4.0         Жук
13   1.0       Жуков
14   2.0     Зайцева
15   5.0     Зайцева
16   1.0      Иванов
17   4.0    Казакова
18   1.0    Казакова
19   2.0  Калашников
20   2.0  Калашников
21   3.0     Кондрат
22   4.0     Костина
23   4.0       Котов
24   5.0    Кузнецов
25   4.0     Лазарев
26   5.0      Лапина
27   4.0       Лукин
28   2.0  Мельникова
29   2.0  Мельникова
30   5.0  Мельникова
31   4.0  Мельникова
32   3.0  Мельникова
33   1.0      Мишина
34   1.0    Одинцова
35   2.0   Ордуханян
36   5.0         Пак
37   4.0         Пак
38   3.0         Пак
39   3.0     Петрова
40   4.0    Семенова
41   1.0    Сергеева
42   4.0     Сидоров
43   1.0    Сорокина
44   1.0     Суханов
45   2.0    Трофимов
46   1.0     Федоров